Repository: globalpayments/prestashop-hybrid
Catalog: translations/*/ModulesGlobalpaymentsLogs.*.xlf
Languages: es_mx, fr_ca

source: Unable to create ApplePay Session
es_mx: No se puede crear una sesión de ApplePay
fr_ca: Impossible de créer une session ApplePay

source: Apple Pay requires your checkout be served over HTTPS
es_mx: Apple Pay requiere que su pago se realice a través de HTTPS
fr_ca: Apple Pay exige le protocole HTTPS pour votre page de paiement

source: Apple Pay is not supported on this device/browser
es_mx: Apple Pay no es compatible con este dispositivo/navegador
fr_ca: Apple Pay n'est pas pris en charge par ce dispositif/navigateur

source: Order ID: %ord_id%. Order not found
es_mx: ID de pedido: %ord_id%. Orden no encontrada
fr_ca: ID de commande : %ord_id%. Commande introuvable

source: Order ID: %ord_id%. Transaction ID changed. Expected %gateway_trn_id% but found %order_trn_id%.
es_mx: ID de pedido: %ord_id%. El ID de transacción cambió. Se esperaba %gateway_trn_id%, pero se encontró %order_trn_id%.
fr_ca: ID de commande: %ord_id%. ID de transaction changé. %gateway_trn_id% attendu, mais %order_trn_id% trouvé.

source: This request method is not supported.
es_mx: Este método de solicitud no es compatible.
fr_ca: Cette méthode de requête n'est pas prise en charge.

source: Invalid request signature.
es_mx: Firma de solicitud no válida.
fr_ca: Signature de requête invalide.

source: Order ID: %ord_od%. Missing payment method id.
es_mx: ID del pedido: %ord_od%. Falta el ID del método de pago.
fr_ca: ID de commande: %ord_od%. ID de mode de paiement manquant.

source: Order ID: %ord_id%. Unexpected transaction status on statusUrl: %trn_status%
es_mx: ID de pedido: %ord_id%. Estado de transacción inesperado en statusUrl: %trn_status%
fr_ca: ID de commande: %ord_id%. Statut de transaction inattendu de l'UrlRetour : %trn_status%

source: Error completing order status. %message%
es_mx: Error al completar el estado del pedido. %message%
fr_ca: Erreur d'exécution du statut de commande. %message%

source: Order ID: %ord_id%. Unexpected transaction status on returnUrl: %trn_status%
es_mx: ID del pedido: %ord_id%. Estado de transacción inesperado en la URL de retorno: %trn_status%
fr_ca: ID de commande : %ord_id%. Statut de transaction inattendu de l'UrlRetour : %trn_status%

source: Error completing order return. %message%
es_mx: Error al completar la devolución del pedido. %message%
fr_ca: Erreur d'exécution de retour de commande. %message%

source: Error completing order cancel. %message%
es_mx: Error al completar la cancelación del pedido. %message%
fr_ca: Erreur d'exécution d'annulation de commande. %message%
