Repository: globalpayments/prestashop-hybrid
Catalog: translations/*/ModulesGlobalpaymentsShop.*.xlf
Languages: es_mx

source: Please accept the terms of service
es_mx: Por favor acepte los términos de servicio.

source: Please try again with another card.
es_mx: Por favor, inténtelo de nuevo con otra tarjeta.

source: We're not able to process this payment. Please refresh the page and try again.
es_mx: No podemos procesar este pago. Actualice la página e inténtelo de nuevo.

source: Something went wrong while doing 3DS processing.
es_mx: Algo salió mal al procesar 3DS.

source: Card Holder Name
es_mx: Nombre del titular de la tarjeta

source: Please enter a valid Card Holder Name
es_mx: Ingrese un nombre de titular de tarjeta válido

source: Credit Card Number
es_mx: Número de Tarjeta de Crédito

source: Please enter a valid Credit Card Number
es_mx: Por favor, introduzca un número de tarjeta de crédito válido

source: Credit Card Expiration Date
es_mx: Fecha de vencimiento de la tarjeta de crédito

source: Please enter a valid Credit Card Expiration Date
es_mx: Ingrese una fecha de vencimiento de tarjeta de crédito válida

source: Credit Card Security Code
es_mx: Código de seguridad de tarjeta de crédito

source: Please enter a valid Credit Card Security Code
es_mx: Ingrese un código de seguridad de tarjeta de crédito válido

source: %title% - %type% ending in %last4% (%month%/%year%)
es_mx: %title% - %type% termina en %last4% (%month%/%year%)

source: We're unable to take your payment through Apple Pay. Please try again or use an alternative payment method.
es_mx: No podemos aceptar su pago a través de Apple Pay. Inténtalo de nuevo o utiliza un método de pago alternativo.

source: 3DS Authentication failed. Please try again.
es_mx: Error de autenticación 3DS. Por favor inténtalo de nuevo.

source: Please check the Shipping address.
es_mx: Por favor, verifica la dirección de envío

source: Please check the Billing address.
es_mx: Por favor, verifica la dirección de facturación

source: Zip/Postal Code is mandatory.
es_mx: El Código Postal el obligatorio

source: Telephone is mandatory.
es_mx: El Teléfono es obligatorio

source: My Cards - Global Payments
es_mx: MIS TARJETAS - GLOBAL PAYMENTS

source: Your payment was unsuccessful. Please try again or use a different payment method.
es_mx: "Su pago no fue exitoso. Inténtalo de nuevo o utilice un método de pago diferente."

source: An error occurred while processing the payment. Please try again or use a different payment method.
es_mx: "Se produjo un error al procesar el pago. Inténtalo de nuevo o utiliza un método de pago diferente."

source: Your order
es_mx: tu pedido

source: Not enough data to perform 3DS. Unable to retrieve token.
es_mx: No hay suficientes datos para ejecutar 3DS. No se puede recuperar el token.

source: Thank you. Your order has been received, but we have encountered an issue when redirecting back. Please contact us for assistance.
es_mx: Gracias. Su pedido ha sido recibido, pero hemos encontrado un problema al redirigir nuevamente. Por favor contáctenos para obtener ayuda.

source: Bank Payment Logo
es_mx: Logotipo de pago bancario

source: This page is currently in sandbox/test mode. Do not use real/active card numbers.
es_mx: Esta página se encuentra actualmente en modo sandbox/prueba. No utilice números de tarjetas reales/activos.

source: Save for later use
es_mx: Guardar para uso futuro

source: Type
es_mx: Tipo

source: Card number
es_mx: Número de tarjeta

source: Validity
es_mx: Validez

source: Delete
es_mx: Borrar

source: You haven't registered a card yet.
es_mx: Aún no has registrado ninguna tarjeta.
